[
  {
    "id": "thesis-wsss",
    "title": "Weakly Supervised Semantic Segmentation With Image Labels",
    "description": "Enhancing fine-grained object understanding in weakly supervised semantic segmentation—where just image-level labels are available rather than expensive pixel-level masks—was the main emphasis of my undergraduate thesis. The primary goal was to develop more accurate and detailed Class Activation Maps (CAMs), which serve as the foundation for segmentation pipelines with minimal supervision. I employed UniCL alongside a Swin Transformer, opting for this combination over commonly used encoders such as CLIP or ViT, to enhance the capture of local features. The windowed self-attention mechanism of the Swin Transformer enabled better local feature representation and greater spatial consistency.\n\nI experimented with multiple stages of the WSSS pipeline, including:\n• CAM generation using transformer-based features\n• Refinement and smoothing through affinity-based consistency\n• Utilizing intermediate encoder features to improve boundary precision and reduce noise\n• Iterative mask enhancement to recover fine-grained details in complex regions\n\nMy method generated segmentation masks with clearer boundaries, more uniform region coverage, and enhanced preservation of fine details compared to conventional techniques. The final model achieved a mean IoU of 50%, which, while below the SOTA benchmark, demonstrated significant improvements in local detail sharpness, object boundary accuracy, and spatial coherence across many categories.\n\nThis project strengthened my practical understanding of:\n• Transformer architectures (Swin, ViT-family, UniCL)\n• Weakly supervised segmentation pipelines\n• CAM refinement, affinity propagation, and mask generation\n• Designing and evaluating ML experiments\n• Building reproducible research codebases",
    "stack": ["Python", "PyTorch", "Swin Transformer", "UniCL", "CAM"],
    "github": "https://github.com/abeshahsan/semantic-segmentation-from-scratch",
    "demo": null,
    "image": null
  }
]
